---
kind: other
id: Methods.T:Autodesk.Revit.DB.Blend
source: html/1b54da24-807c-6f64-a85d-daccb72ac487.htm
---
# Blend Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.